app/views/alram_tests/index.html.erb

<% @my_alrams.each do |row| %>
	<li>회원님의 <%= AlramTest.find(row.board_id).title %> 게시글에 <%= link_to "#{row.post_link}" do %><%= row.new_post_title %>댓글이 등록되었습니다.<% end %></li>
---
SELECT "alram_tests".* FROM "alram_tests" WHERE "alram_tests"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]