app/controllers/alram_tests_controller.rb

  def index
    @alram_tests = AlramTest.all
	@my_alrams = AlramBoard.where(user_id: current_user.id).order(:id)
---
SELECT "alram_tests".* FROM "alram_tests"
SELECT "alram_boards".* FROM "alram_boards" WHERE "alram_boards"."user_id" = ? ORDER BY "alram_boards"."id" ASC  [["user_id", 1]]

  def show
	@re_post = RePost.new
	@comment = RePost.where(alram_test_id: @alram_test.id).order(:id)
---
SELECT "re_posts".* FROM "re_posts" WHERE "re_posts"."alram_test_id" = ? ORDER BY "re_posts"."id" ASC  [["alram_test_id", 2]]

  def create
    @alram_test = AlramTest.new(alram_test_params)

    respond_to do |format|
      if @alram_test.save
---
INSERT INTO "alram_tests" ("title", "desc", "user_id", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?)  [["title", "OOO 데이터 분석 의뢰"], ["desc", "dk..."], ["user_id", 1], ["created_at", "2020-09-26 05:38:13.400784"], ["updated_at", "2020-09-26 05:38:13.400784"]]

  def update
    respond_to do |format|
      if @alram_test.update(alram_test_params_for_update)
---
UPDATE "alram_tests" SET "desc" = ?, "updated_at" = ? WHERE "alram_tests"."id" = ?  [["desc", "테스트트트2"], ["updated_at", "2020-09-26 04:48:03.504591"], ["id", 2]]

  def destroy
    @alram_test.destroy
---
DELETE FROM "alram_tests" WHERE "alram_tests"."id" = ?  [["id", 2]]

    def set_alram_test
      @alram_test = AlramTest.find(params[:id])
---
SELECT "alram_tests".* FROM "alram_tests" WHERE "alram_tests"."id" = ? LIMIT ?  [["id", 2], ["LIMIT", 1]]