app/controllers/re_posts_controller.rb

  def create
    @re_post = RePost.new(re_post_params)

    respond_to do |format|
      if @re_post.save
---
INSERT INTO "re_posts" ("user_id", "comment", "alram_test_id", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?)  [["user_id", 1], ["comment", "asdfasdf"], ["alram_test_id", 2], ["created_at", "2020-09-26 05:25:16.696080"], ["updated_at", "2020-09-26 05:25:16.696080"]]