app/models/re_post.rb

  def update_alrams
	  original_post_user_id = AlramTest.find(self.alram_test_id).user_id
	  AlramBoard.create!(user_id: original_post_user_id, board_id: self.alram_test_id, new_post_id: self.id, new_post_title:self.comment, post_link: "alram_tests/#{self.alram_test_id}")
---
SELECT "users".* FROM "users" WHERE "users"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]
SELECT "alram_tests".* FROM "alram_tests" WHERE "alram_tests"."id" = ? LIMIT ?  [["id", 2], ["LIMIT", 1]]
INSERT INTO "alram_boards" ("user_id", "board_id", "post_link", "new_post_id", "new_post_title", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?, ?, ?)